app/Controllers/kategoriController.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data['kategori'] = $this->kategoriModel->findAll(); // Mengambil semua kategori