app/Controllers/PelangganController.php

    public function index()
    {
        $model = new PelangganModel();
        $data['pelanggan'] = $model->findAll();
---
SELECT *
FROM `pelanggan`