app/Controllers/produkController.php

SELECT *
FROM `produk`
SELECT *
FROM `kategori`
---
    public function index()
    {
        $produk = $this->produkModel->findAll();
        $kategori = $this->kategoriModel->findAll(); // Mengambil semua kategori